app/Http/Controllers/MainQueueController.php

SELECT * FROM `servers` WHERE `uuidShort` = '2035dddf' LIMIT 1
---
    public function getWebSocketData($serverUUIDShort)
    {
        $server = Server::where("uuidShort", $serverUUIDShort)->first();

SELECT * FROM `ticket` WHERE `uuidShort` = 'fbdbd0ec' LIMIT 1
SELECT * FROM `ticket`
SELECT * FROM `servers` WHERE `uuidShort` = 'fbdbd0ec' LIMIT 1
---
    public function index(Request $request, Server $server)
    {
        if ($request->all()['pos']){
            $uuidshort = $server->uuidShort;
        $uuid = $server->uuid;
        $ticket = Ticket::where('uuidShort', $uuidshort)->first();
        if ($ticket){
        return response(["pos"=> $ticket->turn], 200);
        }else{

        return response(["pos"=> 0], 200);
        }
        }else{
            if ($request->all()['input']) {
                $uuidshort = $server->uuidShort;
            $uuid = $server->uuid;
            $tickets = Ticket::all();
            $tickets = $tickets->sortByDesc('turn');
            if ($tickets){
                foreach ($tickets as $ticket){
                    $serv = Server::where('uuidShort', $ticket->uuidShort)->first();

SELECT * FROM `ticket` WHERE `uuidShort` = 'fbdbd0ec' LIMIT 1
SELECT * FROM `servers` WHERE `uuidShort` = 'fbdbd0ec' LIMIT 1
DELETE FROM `ticket` WHERE `id` = 10
---
                        $counter += 1;
                    }*/
                    if (($max - $fuller) >= 0){
                        $ticket = Ticket::where('uuidShort', $uuidshort)->first();
                        $this->WakeUp($uuidshort);
                        if ($ticket){
                            $checker = $this->checkIfUp(Server::where('uuidShort', $ticket->uuidShort)->first());
                    if ($checker){
                        $ticket->delete();